#!/bin/bash

# Виводимо поточний режим роботи, якщо змінна MODE не встановлена, виводимо "не встановлено"
echo "Поточний режим: ${MODE:-не встановлено}"

# Перевіряємо, чи встановлена змінна MODE
if [ -z "$MODE" ]; then
    # Якщо змінна MODE не встановлена, виводимо повідомлення про помилку і завершуємо виконання скрипта
    echo "Помилка: Змінна MODE не встановлена. Використовуйте 'dev' або 'prod'."
    exit 1
fi

# Якщо змінна MODE встановлена у "dev" (режим розробки)
if [ "$MODE" = "dev" ]; then
    # Виводимо повідомлення про запуск у режимі розробки
    echo "Запуск у режимі розробки..."
    # Запускаємо сервер Uvicorn з параметрами для режиму розробки (автоматичне перезавантаження)
    exec uvicorn src.main:app --host 0.0.0.0 --port 8000 --reload
else
    # Якщо змінна MODE встановлена у будь-яке інше значення, вважаємо, що це продакшн-режим
    echo "Запуск у продакшн-режимі..."
    # Запускаємо сервер Uvicorn без автоматичного перезавантаження
    exec uvicorn src.main:app --host 0.0.0.0 --port 8000
fi
